### Have you ever found yourself running the same query over and over again? 

### Maybe, you used to keep a text copy of the query in your desktop notes app, but that was all before you knew about views!

# In a database, a VIEW is the result set of a stored query, which can be queried in the same manner as a persistent database collection object.

In [27]:
%reload_ext sql

In [12]:
%sql $DATABASE_URL

## Because views are very useful, it's common to end up with many of them in your database. It's important to keep track of them so that database users know what is available to them.

## Always give descriptive names for views!

In [37]:
%sql SELECT * FROM information_schema.views WHERE table_schema NOT IN ('pg_catalog', 'information_schema');

 * postgresql://tati:***@localhost/dvdrental
7 rows affected.

[('dvdrental', 'public', 'actor_info', " SELECT a.actor_id,\n    a.first_name,\n    a.last_name,\n    group_concat(DISTINCT (((c.name)::text || ': '::text) || ( SELECT group_concat((f.title ... (442 characters truncated) ...  ON ((fa.film_id = fc.film_id)))\n     LEFT JOIN category c ON ((fc.category_id = c.category_id)))\n  GROUP BY a.actor_id, a.first_name, a.last_name;", 'NONE', 'NO', 'NO', 'NO', 'NO', 'NO'),
 ('dvdrental', 'public', 'customer_list', ' SELECT cu.customer_id AS id,\n    (((cu.first_name)::text || \' \'::text) || (cu.last_name)::text) AS name,\n    a.address,\n    a.postal_code AS "z ... (252 characters truncated) ... N ((cu.address_id = a.address_id)))\n     JOIN city ON ((a.city_id = city.city_id)))\n     JOIN country ON ((city.country_id = country.country_id)));', 'NONE', 'NO', 'NO', 'NO', 'NO', 'NO'),
 ('dvdrental', 'public', 'film_list', " SELECT film.film_id AS fid,\n    film.title,\n    film.description,\n    category.name AS category,\n    film.rental_rate AS price,\n    film.length ... (384 characters truncated) ... actor.actor_id = actor.actor_id)))\n  GROUP BY film.film_id, film.title, film.description, category.name, film.rental_rate, film.length, film.rating;", 'NONE', 'NO', 'NO', 'NO', 'NO', 'NO'),
 ('dvdrental', 'public', 'nicer_but_slower_film_list', ' SELECT film.film_id AS fid,\n    film.title,\n    film.description,\n    category.name AS category,\n    film.rental_rate AS price,\n    film.length ... (526 characters truncated) ... actor.actor_id = actor.actor_id)))\n  GROUP BY film.film_id, film.title, film.description, category.name, film.rental_rate, film.length, film.rating;', 'NONE', 'NO', 'NO', 'NO', 'NO', 'NO'),
 ('dvdrental', 'public', 'sales_by_film_category', ' SELECT c.name AS category,\n    sum(p.amount) AS total_sales\n   FROM (((((payment p\n     JOIN rental r ON ((p.rental_id = r.rental_id)))\n     JOI ... (125 characters truncated) ... y fc ON ((f.film_id = fc.film_id)))\n     JOIN category c ON ((fc.category_id = c.category_id)))\n  GROUP BY c.name\n  ORDER BY (sum(p.amount)) DESC;', 'NONE', 'NO', 'NO', 'NO', 'NO', 'NO'),
 ('dvdrental', 'public', 'sales_by_store', " SELECT (((c.city)::text || ','::text) || (cy.country)::text) AS store,\n    (((m.first_name)::text || ' '::text) || (m.last_name)::text) AS manager, ... (404 characters truncated) ... staff m ON ((s.manager_staff_id = m.staff_id)))\n  GROUP BY cy.country, c.city, s.store_id, m.first_name, m.last_name\n  ORDER BY cy.country, c.city;", 'NONE', 'NO', 'NO', 'NO', 'NO', 'NO'),
 ('dvdrental', 'public', 'staff_list', ' SELECT s.staff_id AS id,\n    (((s.first_name)::text || \' \'::text) || (s.last_name)::text) AS name,\n    a.address,\n    a.postal_code AS "zip cod ... (120 characters truncated) ... ON ((s.address_id = a.address_id)))\n     JOIN city ON ((a.city_id = city.city_id)))\n     JOIN country ON ((city.country_id = country.country_id)));', 'NONE', 'NO', 'NO', 'NO', 'NO', 'NO')]

- ## Views can be queried in the same way as normal tables

- ## Unlike inserting and updating, redefining a view doesn't mean modifying the actual data a view holds. Rather, it means modifying the underlying query that makes the view.

In [29]:
%sql SELECT * FROM actor_info LIMIT 5;

 * postgresql://tati:***@localhost/dvdrental
5 rows affected.

[(1, 'Penelope', 'Guiness', 'Animation: Anaconda Confessions, Children: Language Cowboy, Classics: Color Philadelphia, Westward Seabiscuit, Comedy: Vertigo Northwest, Documentary ... (144 characters truncated) ... nt Trojan, Lady Stage, Rules Human, Music: Wizard Coldblooded, New: Angels Life, Oklahoma Jumanji, Sci-Fi: Cheaper Clyde, Sports: Gleaming Jawbreaker'),
 (2, 'Nick', 'Wahlberg', 'Action: Bull Shawshank, Animation: Fight Jawbreaker, Children: Jersey Sassy, Classics: Dracula Crystal, Gilbert Pelican, Comedy: Mallrats United, Rus ... (216 characters truncated) ... ing, New: Destiny Saturday, Flash Wars, Jekyll Frogmen, Mask Peach, Sci-Fi: Chainsaw Uptown, Goodfellas Salute, Travel: Liaisons Sweet, Smile Earring'),
 (3, 'Ed', 'Chase', 'Action: Caddyshack Jedi, Forrest Sons, Classics: Frost Head, Jeepers Wedding, Documentary: Army Flintstones, French Holiday, Halloween Nuts, Hunter A ... (133 characters truncated) ...  Alone Trip, New: Eve Resurrection, Platoon Instinct, Sci-Fi: Weekend Personal, Sports: Artist Coldblooded, Image Princess, Travel: Boondock Ballroom'),
 (4, 'Jennifer', 'Davis', 'Action: Barefoot Manchurian, Animation: Anaconda Confessions, Ghostbusters Elf, Comedy: Submarine Bed, Documentary: Bed Highball, National Story, Rai ... (167 characters truncated) ... klahoma Jumanji, Sci-Fi: Random Go, Silverado Goldfinger, Unforgiven Zoolander, Sports: Instinct Airport, Poseidon Forever, Travel: Boondock Ballroom'),
 (5, 'Johnny', 'Lollobrigida', 'Action: Amadeus Holy, Grail Frankenstein, Rings Heartbreakers, Animation: Sunrise League, Children: Hall Cassidy, Comedy: Daddy Pittsburgh, Documenta ... (300 characters truncated) ... dfellas Salute, Soldiers Evolution, Sports: Groove Fiction, Kramer Chocolate, Star Operation, Travel: Enough Raging, Escape Metropolis, Smile Earring')]

## Access control is a key aspect of database management. Not all database users have the same needs and goals, from analysts, clerks, data scientists, to data engineers. As a general rule of thumb, write access should never be the default and only be given when necessary.

In [31]:
# Revoke everyone's update and insert privileges
%sql REVOKE UPDATE, INSERT ON sales_by_film_category FROM PUBLIC;

 * postgresql://tati:***@localhost/dvdrental
Done.

[]

In [34]:
# Grant the user 'tati' update and insert privileges 
%sql GRANT UPDATE, INSERT ON sales_by_film_category TO tati;

 * postgresql://tati:***@localhost/dvdrental
Done.

[]

# Materialized views

### The syntax for creating materialized and non-materialized views are quite similar because they are both defined by a query. One key difference is that we can refresh materialized views, while no such concept exists for non-materialized views. It's important to know how to refresh a materialized view, otherwise the view will remain a snapshot of the time the view was created.

In [72]:
%sql CREATE MATERIALIZED VIEW language_count AS SELECT COUNT(*) FROM language;

 * postgresql://tati:***@localhost/dvdrental
1 rows affected.

[]

In [88]:
%sql SELECT * FROM language_count;

 * postgresql://tati:***@localhost/dvdrental
1 rows affected.

[(6,)]

In [89]:
%sql INSERT INTO language VALUES (7, 'Portuguese');

 * postgresql://tati:***@localhost/dvdrental
1 rows affected.

[]

In [90]:
%sql REFRESH MATERIALIZED VIEW language_count;

 * postgresql://tati:***@localhost/dvdrental
Done.

[]

In [91]:
%sql SELECT * FROM language_count;

 * postgresql://tati:***@localhost/dvdrental
1 rows affected.

[(7,)]